/*
 * @author Wang Jie
 * @author Yang Yang
 */

#ifndef CDESIGN_MENU_H
#define CDESIGN_MENU_H
#include <stdbool.h>
#include "print_color.h"
#include<stdio.h>

void print_menu();
void print_menu()
{
        printf(
                REVERSE L_BLUE  "****************************************************\n"NONE
                REVERSE L_BLUE  "*                   MENU                           *\n"NONE
                REVERSE L_BLUE  "****************************************************\n"NONE
                REVERSE WHITE "一.酒水                                             \n"
                "              1.君度        25.00元/杯，320.00元/瓶 \n"
                "              2.马天尼      20.00元/杯，260.00元/瓶 \n"
                "              3.百利甜      25.00元/杯，320.00元/瓶 \n"
                "              4.马利宝      20.00元/杯，260.00元/瓶 \n"
                "              5.杰克丹尼    35.00元/杯              \n"
                "              6.百家得      25.00元/杯，320.00元/瓶 \n"
                "              7.哥顿金      20.00元/杯，260.00元/瓶 \n"
                "              8.黑方        30.00元/杯，380.00元/瓶 \n"
                "              9.瑞典伏特加  25.00元/杯，320.00元/瓶 \n"
                "              10.爱丁格     35.00元/杯              \n"
                "              11.柯罗娜     20.00元/杯              \n"
                "              12.喜力       20.00元/杯              \n"
                "              13.嘉士伯     18.00元/杯              \n"
                "              14.青岛       15.00元/杯              \n"
                "              15.波士       20.00元/杯              \n"
                "              16.长岛冰茶   30.00元/杯              \n"
                "              17.金汤力     25.00元/杯              \n"
                "              18.红粉佳人   30.00元/杯              \n"
                "              19.黑俄罗斯   35.00元/杯              \n"
                "              20.蓝色夏威夷  33.00元/杯             \n"
                "二.小吃                                             \n"
                "              1.风味烤鸡翅   20.00元                \n"
                "              2.蒜蓉法宝     10.00元                \n"
                "              3.蔬菜奶酪球   15.00元                \n"
                "              4.爆米花       25.00元                \n"
                "              5.干果虾仁比萨 45.00元                \n"
                "              6.什锦香肠比萨 38.00元                \n"
                "              7.脆皮辣味薯角 18.00元                \n"
                "              8.咖啡冰淇淋   15.00元                \n"
                "三.茶类                                             \n"
                "              1.立顿红茶     45.00元/壶             \n"
                "              2.玫瑰奶茶     58.00元/壶             \n"
                "              3.冰柠檬茶     15.00元/杯，35.00元/壶 \n"
                "              4.西湖龙井     20.00元/杯，65.00元/壶 \n"
                "              5.碧螺春       25.00元/杯，75.00元/壶 \n"
                "              6.铁观音       25.00元/杯，75.00元/壶 \n"
                "四.饮料                                             \n"
                "              1.鲜牛奶      25.00元                 \n"
                "              2.干姜水      16.00元                 \n"
                "              3.菠萝汁      27.00元                 \n"
                "              4.西柚汁      34.00元                 \n"
                "              5.橙汁        26.00元                 \n"
                "              6.矿泉水      8.00 元                 \n"
                "              7.可乐        12.00元                 \n"
                "              8.雪碧        12.00元                 \n"
                "              9.矿泉水      12.00元                 \n"NONE
        );
}

#endif //CDESIGN_MENU_H
