/*
 * @author Elio Yang
 * @email  jluelioyang2001@gamil.com
 * @date 2021/3/18
 */

#ifndef CDESIGN_MENU_H
#define CDESIGN_MENU_H

#include<stdio.h>

void printf_menu()
{
        printf( "一.酒水\n"
                "\t1.君度      \t25.00元/杯，320.00元/瓶\n"
                "\t2.马天尼    \t20.00元/杯，260.00元/瓶\n"
                "\t3.百利甜    \t25.00元/杯，320.00元/瓶\n"
                "\t4.马利宝    \t20.00元/杯，260.00元/瓶\n"
                "\t5.杰克丹尼  \t350.00元/杯\n"
                "\t6.百家得    \t25.00元/杯，320.00元/瓶\n"
                "\t7.哥顿金    \t20.00元/杯，260.00元/瓶\n"
                "\t8.黑方      \t30.00元/杯，380.00元/瓶\n"
                "\t9.瑞典伏特加 \t25.00元/杯，320.00元/瓶\n"
                "\t10.爱丁格   \t35.00元/杯\n"
                "\t11.柯罗娜   \t20.00元/杯\n"
                "\t12.喜力     \t20.00元/杯\n"
                "\t13.嘉士伯   \t18.00元/杯\n"
                "\t14.青岛     \t15.00元/杯\n"
                "\t15.波士     \t20.00元/杯\n"
                "\t16.长岛冰茶  \t30.00元/杯\n"
                "\t17.金汤力    \t25.00元/杯\n"
                "\t18.红粉佳人  \t30.00元/杯\n"
                "\t19.黑俄罗斯  \t35.00元/杯\n"
                "\t20.蓝色夏威夷 \t33.00元/杯\n"
                "二.小吃\n"
                "\t1.金枪鱼凉瓜  \t15.00元\n"
                "\t2.红酒烩白梨  \t25.00元\n"
                "\t3.风味烤鸡翅  \t20.00元\n"
                "\t4.蒜蓉法宝    \t10.00元\n"
                "\t5.蔬菜奶酪球  \t15.00元\n"
                "\t6.爆米花      \t25.00元\n"
                "\t7.干果虾仁比萨 \t45.00元\n"
                "\t8.什锦香肠比萨 \t38.00元\n"
                "\t9.蔬菜奶酪球   \t15.00元\n"
                "\t10.脆皮辣味薯角\t18.00元\n"
                "\t11.咖啡冰淇淋  \t15.00元\n"
                "\t12.香蕉船      \t25.00元\n"
                "\t13.香蕉奶昔    \t16.00元\n"
                "三.茶类"
                "\t1.立顿红茶     \t45.00元/壶\n"
                "\t2.玫瑰奶茶     \t58.00元/壶\n"
                "\t3.冰柠檬茶     \t15.00元/杯，35.00元/壶\n"
                "\t4.西湖龙井     \t20.00元/杯，65.00元/壶\n"
                "\t5.碧螺春       \t25.00元/杯，75.00元/壶\n"
                "\t6.铁观音       \t25.00元/杯，75.00元/壶\n"
                "四.饮料"
                "\t1.鲜牛奶       \t25.00元\n"
                "\t2.干姜水       \t16.00元\n"
                "\t3.菠萝汁       \t27.00元\n"
                "\t4.西柚汁       \t34.00元\n"
                "\t5.橙汁        \t26.00元\n"
                "\t6.矿泉水      \t8.00元\n"
                "\t7.可乐        \t12.00元\n"
                "\t8.雪碧        \t12.00元\n"
                "\t9.矿泉水      \t12.00元\n"
        );
}



#endif //CDESIGN_MENU_H
